demo_dialog/src/InformationRegisters/DialogDemoБазы/DialogDemoБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DialogDemoБазы</name>
  <resources>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

demo_dialog/src/InformationRegisters/DialogDemoБазы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИмяБазы(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	DialogDemoБазы.ИмяБазы КАК ИмяБазы
	|ИЗ
	|	РегистрСведений.DialogDemoБазы КАК DialogDemoБазы
	|ГДЕ
	|	DialogDemoБазы.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИмяБазы = Выборка.ИмяБазы;
	Иначе
		ИмяБазы = "";
	КонецЕсли;
	
	Возврат ИмяБазы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
